type servicesType = {
  id: number;
  title: string;
  desc: string;
};

export const servicesData: servicesType[] = [
  {
    id: 1,
    title: "التدقيق والمراجعة",
    desc: `لدينا أدوات التدقيق والموارد ونتخذ الإجراءات القوية لتنفيذ المهام المطلوبة بمستوى عالي الجودة كما
     نلتزم بأعلى معايير الاستقلالية والموضوعية المهنية والتميز التقني.`,
  },
  {
    id: 2,
    title: "الإستشارات الضريبية",
    desc: `تمثيل العملاء أمام مصلحة الضرائب وتوضيح وجهه نظر الشركة ومدي انطباقها مع صحيح القانون وكذلك اعداد المذكرات والدفوع المطلوبة 
    من أجل تحقيق أكبر وفر ضريبي للشركة.`,
  },
  {
    id: 3,
    title: "الإستشارات مالية",
    desc: "نحن نقدم مجموعة متنوعة من الاستشارات الاستراتيجية والمالية للعملاء فيما يتعلق بتمويل الشركات وتقييمها والأنشطة التجارية الأخرى",
  },
  
];
