type servicesType = {
  id: number;
  title: string;
  desc: string;
};

export const servicesData: servicesType[] = [
  {
    id: 1,
    title: "مسك الدفاتر",
    desc: "تنظيم السجلات المالية وتقديم تقارير دقيقة تساعد في اتخاذ قرارات استراتيجية مبنية على بيانات واضحة",
  },
  {
    id: 2,
    title: "الزكاة والضرائب",
    desc: "إدارة التزامات الزكاة والضرائب بكفاءة عالية مع تقديم الاستشارات المتخصصة لضمان الامتثال وتقليل المخاطر",
  },
  {
    id: 3,
    title: "المراجعة وتدقيق الحسابات",
    desc: "ضمان دقة البيانات المالية وتعزيز الثقة في تقاريرك المحاسبية وفقاً للمعايير المحلية والدولية",
  },
  {
    id: 4,
    title: "مشاريع البيع على الخارطة",
    desc: "خدمات محاسبية ومراجعة مخصصة لمشاريع البيع على الخارطة وفق متطلبات الجهات التنظيمية",
  },
  {
    id: 5,
    title: "الإجراءات المتفق عليها",
    desc: "تنفيذ فحوصات مالية محددة باتفاق مسبق مع العميل لتوفير نتائج دقيقة تخدم متطلباته الخاصة",
  },
  {
    id: 6,
    title: "المحتوى المحلي",
    desc: "دعم المنشآت في احتساب وتطوير المحتوى المحلي بما يتماشى مع أهداف رؤية المملكة 2030",
  },
];
