type Article = {
  id: number;
  image: string;
  title: string;
  slug: string;
  date: string;
};

export const blogData: Article[] = [
  {
    id: 1,
    image:
      "https://res.cloudinary.com/dijoz9ie7/image/upload/v1774624001/posts3-768x512_cu7ws9.webp",
    title: "Local content",
    date: "date",
    slug: "local-content-vision-2030",
  },
  // {
  //   id: 2,
  //   image:
  //     "https://res.cloudinary.com/dijoz9ie7/image/upload/v1774624000/posts2-768x512_zrh45p.webp",
  //   title: "الزكاة والضرائب في المملكة: بين الالتزام والفرص المالية",
  //   desc: `تُعتبر الزكاة والضرائب من أهم الركائز التي تنظم العلاقة بين المنشآت والدولة، وهي ليست مجرد التزام مالي، بل أداة لتحقيق العدالة الاقتصادية والمساهمة في التنمية الوطنية.`,
  //   date: "نوفمبر 6, 2025",
  //   slug: "zakat-taxes-kingdom",
  //   content: [
  //     "تُعتبر الزكاة والضرائب من أهم الركائز التي تنظم العلاقة بين المنشآت والدولة، وهي ليست مجرد التزام مالي، بل أداة لتحقيق العدالة الاقتصادية والمساهمة في التنمية الوطنية.",
  //     "ومن هذا المنطلق، تزداد أهميتها إدارياً باحترافية ودقة لضمان الامتثال وتجنب الغرامات أو الأخطاء الحسابية.",
  //     "يخضع التعامل المالي في المملكة لأنظمة محددة تضبطها هيئة الزكاة والضرائب والجمارك، تشمل الزكاة الشرعية على الشركات السعودية، وضريبة الدخل على المنشآت الأجنبية أو المختلطة، بالإضافة إلى ضريبة القيمة المضافة.",
  //     "تبدأ عملية إدارة الزكاة والضرائب الصحيحة من جمع البيانات المالية الصحيحة، مروراً بإعداد الإقرارات الزكوية والضريبية، والانتهاء بتقديمها في المواعيد المحددة.",
  //     "وفنًا تظهر أهمية وجود مستشارين ماليين محترفين يملكون فهمًا عميقًا للأنظمة والتحديثات المستمرة من الهيئة.",
  //     "كما أن التخطيط الزكوي والضريبي الذي يمكن أن يساعد الشركات على تحقيق وفورات مالية كبيرة، من خلال الاستفادة من الإعفاءات والتسهيلات والإعانات المتاحة، دون الإخلال بمتطلبات الالتزام.",
  //     "ومع تطور البنية الرقمية في المملكة، أصبح التقديم الإلكتروني للإقرارات ومتابعتها عبر المنصات الرسمية أمراً أكثر سهولة وفاعلية.",
  //     "ومع ذلك، فإن الدقة في الإعداد والمراجعة تبقى العامل الأهم في تجنب الأخطاء والملاحظات من الهيئة.",
  //     "خلاصةً، فإن الإدارة الصحيحة للزكاة والضرائب ليست عبئًا على المنشأة، بل وسيلة لتعزيز سمعتها وامتثالها وثقة المجتمع بها، مما ينعكس إيجاباً على استقرارها ونموها المالي.",
  //   ],
  // },
  {
    id: 3,
    image:
      "https://res.cloudinary.com/dijoz9ie7/image/upload/v1774624000/posts1-768x512_x6ap2n.webp",
    title: "Auditing",
     date: "date",
    slug: "auditing-financial-trust",
  },
];
