type articles = {
  id: number;
  image: string;
  title: string;
  desc: string;
  date: string;
};

export const blogData: articles[] = [
  {
    id: 1,
    image:
      "https://res.cloudinary.com/dijoz9ie7/image/upload/v1774624001/posts3-768x512_cu7ws9.webp",
    title: "المحتوى المحلي ودوره في دعم الاقتصاد الوطني ورؤية 2030",
    desc: `يُعد المحتوى المحلي من المفاهيم الحديثة التي اكتسبت أهمية متزايدة في السنوات الأخيرة،
       خصوصًا بعد إطلاق رؤية المملكة 2030 التي تهدف إلى تنويع الاقتصاد الوطني وتعزيز الاعتماد على الموارد المحلية.`,
    date: "نوفمبر 6, 2025",
  },
  {
    id: 2,
    image:
      "https://res.cloudinary.com/dijoz9ie7/image/upload/v1774624000/posts2-768x512_zrh45p.webp",
    title: "الزكاة والضرائب في المملكة: بين الالتزام والفرص المالية",
    desc: `تُعتبر الزكاة والضرائب من أهم الركائز التي تنظم العلاقة بين المنشآت والدولة،
     وهي ليست مجرد التزام مالي، بل أداة لتحقيق العدالة الاقتصادية والمساهمة في التنمية الوطنية. ومن هذا المنطلق، تزداد`,
    date: "نوفمبر 6, 2025",
  },
  {
    id: 3,
    image:
      "https://res.cloudinary.com/dijoz9ie7/image/upload/v1774624000/posts1-768x512_x6ap2n.webp",
    title: "أهمية المراجعة وتدقيق الحسابات في تعزيز الثقة المالية",
    desc: `تُعد المراجعة وتدقيق الحسابات أحد أهم العناصر التي تساهم في استقرار واستدامة بيئة الأعمال،
     فهي ليست مجرد إجراء محاسبي روتيني، بل وسيلة أساسية لضمان الشفافية وبناء الثقة بين المنشأة وأصحابها`,
    date: "نوفمبر 6, 2025",
  },
];
